import { NextPage } from 'next'
import styled from 'styled-components'

const Privacy: NextPage = () => {
  return (
    <div>
      <Title>Политика конфиденциальности</Title>
      <List>
        <li>
          <b>1. Общая информация</b>
        </li>
        <li>
          1.1. Данный документ является действующим сводом правил по
          использованию ресурсов портала Кинопоиск и определяет порядок защиты
          информации о пользователях данного ресурса и ее дальнейшую обработку.
        </li>
        <li>
          1.2. Правила необходимы для гарантии защиты персональных данных
          пользователей ресурса от разглашения, передачи третьим лицам и
          несанкционированного доступа к аккаунтам.
        </li>
        <li>
          1.3. Регуляция порядка сбора, хранения, защиты и распространения
          информации регулируется действующими правилами, а также другими
          официальными положениями, предоставленными администрацией (согласно
          действующей Законодательной базой Российской Федерации).
        </li>
        <li>
          1.4. Настоящие правила являются публичным документом и доступны
          каждому пользователю сети Интернет. Администрация имеет право вносить
          правки и изменения в данный документ с уведомлением владельцев
          профилей о доступе новой редакции по вышеуказанному адресу минимум за
          10 календарных дней до момента вступления изменений в силу. Все
          предыдущие редакции доступны в архиве сайта.
        </li>
        <li>
          1.5. Последняя редакция правил разработана в соответствии с
          пользовательским соглашением. При наличии противоречий между
          действующими правилами и другими официальными документами сайта,
          решающим документом становятся правила, принятые администрацией.
        </li>
        <li>
          1.6. При прохождении процедуры регистрации и использовании ресурсов
          портала пользователи соглашаются с правилами и должны действовать в их
          рамках.
        </li>
        <li>
          1.7. Если пользователь не согласен с любым из пунктов правил,
          использование ресурсов сервиса должно быть немедленно прекращено.
        </li>
        <br />
        <li>
          <b>2. Правила использования портала</b>
        </li>
        <li>
          2.1. Администрация, предоставляя пользователям возможность
          использовать все сервисы сайта, действуя разумно и рассудительно,
          считает, что пользователь:
        </li>
        <li>
          2.1.1. может использовать сайт и все его сервисы, а также осуществлять
          регистрацию с внесением личных данных благодаря обладанию всеми
          необходимыми правами;
        </li>
        <li>
          2.1.2. указывает только достоверную информацию при создании профиля в
          тех объемах, которые необходимы для использования ресурса;
        </li>
        <li>
          2.1.3. полностью осознает, что предоставленная общая и личная
          информация может быть использована другими пользователями, а также
          копироваться для дальнейшего распространения;
        </li>
        <li>
          2.1.4. понимает, что ряд данных, которые были переданы пользователем
          другим лицам по собственному решению, не может быть удален
          пользователем самостоятельно;
        </li>
        <li>
          2.1.5. ознакомлен со всеми пунктами последней редакции правил и
          полностью с ними согласен, принимая перечисленные права и обязанности
          пользователя сайта.
        </li>
        <li>
          2.2. Проверка достоверности введенных данных проводится администрацией
          только для выполнения полного объема обязательств администрации по
          отношению к пользователю. В иных случаях, проверка данных не
          производится.
        </li>
        <br />
        <li>
          <b>3. Цель сбора информации</b>
        </li>
        <li>
          Для выполнения всех обязательств администрации по отношению к
          владельцам аккаунтов портала осуществляется сбор, обработка и хранение
          персональной информации в необходимом объеме.
        </li>
        <br />
        <li>
          <b>4. Необходимые данные</b>
        </li>
        <li>
          4.1. Необходимые персональные данные пользователей включают в себя:
        </li>
        <li>
          4.1.1. Минимальный объем данных для прохождения регистрации, а именно
          адрес электронной почты с доменом Gmail, либо имя-идентификатор в
          социальной сети ВКонтакте с указанием адреса электронной почты, либо
          имя пользователя Telegram также с введением адреса электронной почты.
        </li>
        <li>
          4.1.2. Для выполнения обязательств администрации по отношению к
          пользователям, вытекающих из договора по предоставлению услуг,
          администрация имеет право дополнительно запрашивать другие
          персональные данные: скан-копию документов, удостоверяющих личность с
          содержанием имени, фамилии и фотографии, а также другую информацию с
          целью защиты прав третьих лиц и исключения злоупотребления
          использования сервисов ресурса.
        </li>
        <li>
          4.2. Информация о владельцах профилей иного рода, которая необходима
          администрации для обработки, включает в себя:
        </li>
        <li>
          4.2.1. автоматические данные, получаемые сервером при переходе на
          портал и использовании его ресурсов, выполнение ряда других действий,
          включая информацию о виде операционной системы, посещаемых страницах
          портала, IP-адрес хоста и т.д.;
        </li>
        <li>
          4.2.2. автоматические данные, получаемые при переходе на портал с
          использованием закладок;
        </li>
        <li>
          4.2.3. созданная публичная информация, включая отзывы, комментарии,
          публикации и другое;
        </li>
        <li>
          4.2.4. информация о взаимодействии пользователей на сайте, включение
          других пользователей в список подписки и т.д.
        </li>
        <br />
        <li>
          <b>5. Условия обработки персональных данных</b>
        </li>
        <li>5.1. Обработка персональных данных выполняется на основе:</li>
        <li>
          5.1.1. законности методов обработки информации и целей их
          использования;
        </li>
        <li>5.1.2. добросовестности и честности;</li>
        <li>
          5.1.3. соответствия полномочий администрации ресурса и целей обработки
          персональных данных с заранее определенными и указанными в правилах.
        </li>
        <li>
          5.1.4. соответствия методов обработки данных и их объема с правилами
          портала;
        </li>
        <li>
          5.1.5. недопустимости объединения и пересечения разных баз данных с
          личной информацией.
        </li>
        <li>5.2. Условия и цели обработки персональных данных</li>
        <li>
          Обработка персональных данных осуществляется администрацией ресурса.
          Целью проведения обработки является исполнение обязательств согласно
          договору между пользователем и администрацией сайта для оказания услуг
          в должном объеме (согласно пункту 2.2 Пользовательского соглашения).
          Статья 6 Федерального закона от 27.07.2066 № 152-Фз «О персональных
          данных» гласит о том, что согласие Пользователя на обработку
          персональной информации не требуется. Согласно подпункту 2 пункта 2
          статьи 22 вышеуказанного Закона, администрация может осуществлять
          обработку данных без сообщения информации о выполнении процедуры
          соответствующему органу по защите прав персональных данных субъектов.
        </li>
        <li>5.3. Сбор персональных данных</li>
        <li>
          Администрация выполняет сбор персональных данных при регистрации, а
          также при внесении в свой профиль дополнительных сведений при помощи
          инструментария по инициативе самих пользователей.
        </li>
        <li>
          В пункте 4.1.1. действующего свода правил указан минимальный объем
          личных данных, необходимых при регистрации.
        </li>
        <li>
          В пункте 4.1.2. правил представлен перечень дополнительных данных,
          которые пользователь вносит на сайт или делится ними с другими
          пользователями по своей инициативе.
        </li>
        <li>5.4. Хранение и использование персональных данных</li>
        <li>
          Персональная информация хранится исключительно на электронных
          носителях и обрабатывается разными методами путем использования
          автоматических систем. Неавтоматизированная обработка используется
          только в том случае, если такая процедура необходима для исполнения
          требований Законодательства РФ.
        </li>
        <li>5.5. Передача персональных данных</li>
        <li>
          Любые из перечисленных персональных данных не передаются третьим
          лицам, если это не предусмотрено действующими правилами.
        </li>
        <li>
          По инициативе пользователя и его полном согласии, личные данные могут
          быть переданы администрацией третьим лицам, но только в том случае,
          если контрагенты берут на себя в полном объеме обязательства по защите
          и обеспечении конфиденциальности полученной информации.
        </li>
        <li>
          Разработчики (третьи лица), которые предоставляют приложения для их
          использования на сайте, действуют независимо от администрации сайта и
          без ее поручения. Пользователи, которые собираются использовать данные
          приложения, обязаны ознакомиться с правилами контрагента и политикой
          защиты персональной информации, только после этого начать
          использование стороннего ресурса.
        </li>
        <li>
          Действия третьих лиц регламентируются отдельным документом и выложены
          в свободном доступе на портале.
        </li>
        <li>
          Передача данных для хранения и обработки государственными органами
          (включая органы местного самоуправления) выполняется согласно
          требованиям действующего Законодательства РФ.
        </li>
        <li>5.6. Удаление персональных данных</li>
        <li>
          Персональные данные, которые были внесены на страницах сайта, могут
          удалиться:
        </li>
        <li>5.6.1. пользователем со своего профиля по личной инициативе;</li>
        <li>
          5.6.2. администрацией в случаях, установленных правилами пользования
          Кинопоиска.
        </li>
        <br />
        <li>
          <b>6. Обязанности и права</b>
        </li>
        <li>6.1. Пользователи имеют право:</li>
        <li>
          6.1.1. предоставлять доступ к личным данным в свободной и бесплатной
          форме путем входа в свой профиль с использованием логина и пароля,
          созданного при регистрации;
        </li>
        <li>6.1.2. удалять данные о себе со своей страницы;</li>
        <li>
          6.1.3. подавать администрации запрос на получение информации о целях
          обработки полученных данных.
        </li>
        <li>
          6.2. Сайт является средством поиска людей и дальнейшей коммуникации
          между владельцами аккаунтов, поэтому информация о подписках и
          подписчиках находится в свободном доступе и всегда открыта любому
          пользователю данного ресурса.
        </li>
        <br />
        <li>
          <b>7. Ответственность за защиту данных</b>
        </li>
        <li>
          7.1. Для авторизованного входа на сайт используется вход через
          аккаунты сайтов Telegram, VK или Google. Администрация не несет
          ответственности за сохранность данной информации, обязательства по ее
          сохранению лежат только на пользователе. Для защиты данных и
          обеспечения их конфиденциальности пользователь не должен передавать
          свой логин и пароль третьим лицам.
        </li>
        <br />
        <li>
          <b>8. Действие правил</b>
        </li>
        <li>
          Действующий свод правил регулирует исключительно деятельность портала
          Кинопоиск и не распространяется на интернет-ресурсы третьих лиц.
          Администрация не несет ответственности за копирование и обработку
          личных данных третьими лицами. Рекомендуется не превышать необходимый
          объем внесенной информации согласно правилам, ответственно относится к
          передаче личных данных другим пользователям и их публикации на
          страницах ресурса.
        </li>
      </List>
    </div>
  )
}

export default Privacy

const Title = styled.h1`
  margin: 0;
  margin-bottom: 30px;
  font-weight: 500;
  font-size: 44px;
`

const List = styled.ul`
  list-style: none;
  padding: 0;
  font-size: 18px;
  line-height: 160%;

  li {
    padding: 10px 0;

    b {
      font-size: 20px;
    }
  }
`
