import { FilmDetailType } from 'mocks/types'

export const filmsDetailList: FilmDetailType[] = [
  {
    id: '01',
    type: 'FILM',
    nameRu: 'Острые козырьки',
    nameOriginal: 'Peaky Blinders',
    posterUrl: '/static/images/covers/01.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/01.jpg',
    trailerDate: '9 июля 2016',
    trailerLength: '1:56',
    ratingKinopoisk: '8.4',
    ratingKinopoiskVoteCount: '296 496 оценок',
    ratingAgeLimits: '16+',
    description:
      'Британский сериал о криминальном мире Бирмингема 20-х годов прошлого века, в котором многолюдная семья Шелби стала одной из самых жестоких и влиятельных гангстерских банд послевоенного времени. Фирменным знаком группировки, промышлявшей грабежами и азартными играми, стали зашитые в козырьки лезвия.',
    shortDescription:
      'Бывший солдат встает во главе криминального семейного бизнеса. Стильная британская сага с Киллианом Мёрфи. Смотрите онлайн на Кинопоиске.',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Киллиан Мёрфи',
      'Пол Андерсон',
      'Софи Рандл',
      'Хелен Маккрори',
      'Нед Деннехи',
      'Финн Коул',
      'Наташа О’Кифф',
      'Иэн Пек',
      'Гарри Киртон',
      'Пакки Ли',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '2013 (6 сезонов)',
      },
      {
        property: 'Страна',
        value: 'Великобритания',
      },
      {
        property: 'Жанр',
        value: 'драма, криминал',
      },
      {
        property: 'Слоган',
        value: '«The streets are theirs»',
      },
      {
        property: 'Режиссер',
        value: 'Энтони Бирн, Колм МакКарти, Тим Милантс',
      },
      {
        property: 'Сценарий',
        value: 'Стивен Найт, Тоби Финлэй, Стивен Расселл',
      },
      {
        property: 'Продюсер',
        value: 'Кэрин Мэндабах, Джэми Глазенбрук',
      },
      {
        property: 'Оператор',
        value: 'Джордж Стил, Саймон Дэннис, Лори Роуз',
      },
      {
        property: 'Композитор',
        value: 'Мартин Фиппс, Пол Хартнолл, Пи Джей Харви',
      },
      {
        property: 'Художник',
        value: 'Грант Монтгомери, Николь Нортридж',
      },
      {
        property: 'Монтаж',
        value: 'Пол Найт, Марк Дэвис, Селия Хэйнинг',
      },
      {
        property: 'Премьера в Росcии',
        value: '25 октября 2016',
      },
      {
        property: 'Премьера в мире',
        value: '12 сентября 2013',
      },
      {
        property: 'Цифровой релиз',
        value: '30 сентября 2014, «Netflix»',
      },
      {
        property: 'Возраст',
        value: '16+',
      },
      {
        property: 'Время',
        value: '60 мин',
      },
    ],
  },
  {
    id: '02',
    type: 'FILM',
    nameRu: 'Волк с Уолл-стрит',
    nameOriginal: 'The Wolf of Wall Street',
    posterUrl: '/static/images/covers/02.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/02.jpg',
    trailerDate: '3 сентября 2013',
    trailerLength: '2:12',
    ratingKinopoisk: '7.9',
    ratingKinopoiskVoteCount: '863 619 оценок',
    ratingAgeLimits: '18+',
    description:
      '1987 год. Джордан Белфорт становится брокером в успешном инвестиционном банке. Вскоре банк закрывается после внезапного обвала индекса Доу-Джонса. По совету жены Терезы Джордан устраивается в небольшое заведение, занимающееся мелкими акциями. Его настойчивый стиль общения с клиентами и врождённая харизма быстро даёт свои плоды. Он знакомится с соседом по дому Донни, торговцем, который сразу находит общий язык с Джорданом и решает открыть с ним собственную фирму. В качестве сотрудников они нанимают нескольких друзей Белфорта, его отца Макса и называют компанию «Стрэттон Оукмонт». В свободное от работы время Джордан прожигает жизнь: лавирует от одной вечеринки к другой, вступает в сексуальные отношения с проститутками, употребляет множество наркотических препаратов, в том числе кокаин и кваалюд. Однажды наступает момент, когда быстрым обогащением Белфорта начинает интересоваться агент ФБР...',
    shortDescription:
      'Восхождение циника-гедониста на бизнес-олимп 1980-х. Блистательный тандем Леонардо ДиКаприо и Мартина Скорсезе',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Леонардо ДиКаприо',
      'Джона Хилл',
      'Марго Робби',
      'Кайл Чандлер',
      'Роб Райнер',
      'П.Дж. Бирн',
      'Джон Бернтал',
      'Кристин Милиоти',
      'Жан Дюжарден',
      'Мэттью МакКонахи',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '2013',
      },
      {
        property: 'Страна',
        value: 'США',
      },
      {
        property: 'Жанр',
        value: 'драма, криминал, биография, комедия',
      },
      {
        property: 'Слоган',
        value: '«Earn. Spend. Party»',
      },
      {
        property: 'Режиссер',
        value: 'Мартин Скорсезе',
      },
      {
        property: 'Сценарий',
        value: 'Теренс Уинтер, Джордан Белфорт',
      },
      {
        property: 'Продюсер',
        value: 'Риза Азиз, Леонардо ДиКаприо',
      },
      {
        property: 'Оператор',
        value: 'Родриго Прието',
      },
      {
        property: 'Композитор',
        value: '—',
      },
      {
        property: 'Художник',
        value: 'Боб Шоу, Крис Шрайвер',
      },
      {
        property: 'Монтаж',
        value: 'Тельма Скунмейкер',
      },
      {
        property: 'Бюджет',
        value: '$100 000 000',
      },
      {
        property: 'Сборы в США',
        value: '$116 900 694',
      },
      {
        property: 'Сборы в мире',
        value: '+ $275 100 000 = $392 000 694',
      },
      {
        property: 'Сборы в России',
        value: '$13 796 916',
      },
      {
        property: 'Премьера в Росcии',
        value: '6 февраля 2014, «West»',
      },
      {
        property: 'Премьера в мире',
        value: '9 декабря 2013',
      },
      {
        property: 'Возраст',
        value: '18+',
      },
      {
        property: 'Время',
        value: '180 мин. / 03:00',
      },
    ],
  },
  {
    id: '03',
    type: 'SERIAL',
    nameRu: 'Бесстыжие',
    nameOriginal: 'Shameless',
    posterUrl: '/static/images/covers/03.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/03.jpg',
    trailerDate: '25 ноября 2019',
    trailerLength: '0:58',
    ratingKinopoisk: '8.7',
    ratingKinopoiskVoteCount: '321 543 оценки',
    ratingAgeLimits: '18+',
    description:
      'О взбалмошной многодетной семье Галлагеров и их соседях, которые веселятся, попадают в самые невероятные ситуации и пытаются выжить в этом мире всеми возможными средствами, но при этом как можно меньше работая.',
    shortDescription:
      'Жизнь непутевого папаши и его шестерых детей. Микс суровой реальности и абсурда в драмеди о неидеальной семье',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Уильям Х. Мэйси',
      'Итан Каткоски',
      'Джереми Аллен Уайт',
      'Шанола Хэмптон',
      'Стив Хоуи',
      'Эмма Кинни',
      'Камерон Монахэн',
      'Эмми Россам',
      'Майкл Патрик Макгилл',
      'Ноэль Фишер',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '2011 (11 сезонов)',
      },
      {
        property: 'Страна',
        value: 'США',
      },
      {
        property: 'Жанр',
        value: 'драма, комедия',
      },
      {
        property: 'Слоган',
        value: '«The Gallaghers: Absolutely, Wildly, Unapologetically...»',
      },
      {
        property: 'Режиссер',
        value: 'Иэн Б. МакДональд, Марк Майлод',
      },
      {
        property: 'Сценарий',
        value: 'Пол Эбботт, Джон Уэллс',
      },
      {
        property: 'Продюсер',
        value: 'Джон Уэллс, Нэнси Пиментал',
      },
      {
        property: 'Оператор',
        value: 'Кевин МакНайт, Энтони Хардвик',
      },
      {
        property: 'Композитор',
        value: 'Филь Эйслер, Джэми Лабоз',
      },
      {
        property: 'Художник',
        value: 'Нина Руссо, Стефен Олтмэн',
      },
      {
        property: 'Монтаж',
        value: 'Майкл Штерн, Расселл Денов',
      },
      {
        property: 'Премьера в Росcии',
        value: '18 июня 2013',
      },
      {
        property: 'Премьера в мире',
        value: '9 января 2011',
      },
      {
        property: 'Возраст',
        value: '18+',
      },
      {
        property: 'Время',
        value: '55 мин',
      },
    ],
  },
  {
    id: '04',
    type: 'FILM',
    nameRu: 'Форрест Гамп',
    nameOriginal: 'Forrest Gump',
    posterUrl: '/static/images/covers/04.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/04.jpg',
    trailerDate: '18 января 2009',
    trailerLength: '3:54',
    ratingKinopoisk: '8.9',
    ratingKinopoiskVoteCount: '697 225 оценок',
    ratingAgeLimits: '16+',
    description:
      'Сидя на автобусной остановке, Форрест Гамп — не очень умный, но добрый и открытый парень — рассказывает случайным встречным историю своей необыкновенной жизни. С самого малолетства он страдал от заболевания ног, и соседские хулиганы дразнили мальчика, и в один прекрасный день Форрест открыл в себе невероятные способности к бегу. Подруга детства Дженни всегда его поддерживала и защищала, но вскоре дороги их разошлись',
    shortDescription:
      'Полувековая история США глазами чудака из Алабамы. Абсолютная классика Роберта Земекиса с Томом Хэнксом',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Том Хэнкс',
      'Робин Райт',
      'Салли Филд',
      'Гэри Синиз',
      'Майкелти Уильямсон',
      'Майкл Коннер Хэмпфри',
      'Ханна Р. Холл',
      'Сэм Андерсон',
      'Шиван Фэллон',
      'Ребекка Уильямс',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '1994',
      },
      {
        property: 'Страна',
        value: 'США',
      },
      {
        property: 'Жанр',
        value: 'драма, комедия, мелодрама',
      },
      {
        property: 'Слоган',
        value:
          '«Мир уже никогда не будет прежним, после того как вы увидите его глазами Форреста Гампа»',
      },
      {
        property: 'Режиссер',
        value: 'Роберт Земекис',
      },
      {
        property: 'Сценарий',
        value: 'Эрик Рот, Уинстон Грум',
      },
      {
        property: 'Продюсер',
        value: 'Венди Файнерман, Стив Старки, Стив Тиш',
      },
      {
        property: 'Оператор',
        value: 'Дон Бёрджесс',
      },
      {
        property: 'Композитор',
        value: 'Алан Сильвестри',
      },
      {
        property: 'Художник',
        value: 'Рик Картер, Лесли МакДональд',
      },
      {
        property: 'Монтаж',
        value: 'Артур Шмидт',
      },
      {
        property: 'Бюджет',
        value: '$55 000 000',
      },
      {
        property: 'Сборы в США',
        value: '$329 694 499',
      },
      {
        property: 'Сборы в мире',
        value: '+ $347 693 217 = $677 387 716',
      },
      {
        property: 'Сборы в России',
        value: '$84 460',
      },
      {
        property: 'Премьера в Росcии',
        value: '13 февраля 2020, «Иноекино»',
      },
      {
        property: 'Премьера в мире',
        value: '23 июня 1994',
      },
      {
        property: 'Возраст',
        value: '16+',
      },
      {
        property: 'Время',
        value: '142 мин. / 02:22',
      },
    ],
  },
  {
    id: '05',
    type: 'FILM',
    nameRu: 'Король Лев',
    nameOriginal: 'The Lion King',
    posterUrl: '/static/images/covers/05.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/05.jpg',
    trailerDate: '22 марта 2012',
    trailerLength: '1:22',
    ratingKinopoisk: '8.8',
    ratingKinopoiskVoteCount: '574 426 оценок',
    ratingAgeLimits: '0+',
    description:
      'У величественного Короля-Льва Муфасы рождается наследник по имени Симба. Уже в детстве любознательный малыш становится жертвой интриг своего завистливого дяди Шрама, мечтающего о власти. Симба познаёт горе утраты, предательство и изгнание, но в конце концов обретает верных друзей и находит любимую. Закалённый испытаниями, он в нелёгкой борьбе отвоёвывает своё законное место в «Круге жизни», осознав, что значит быть настоящим Королём.',
    shortDescription:
      'Львенок Симба бросает вызов дяде-убийце. Величественный саундтрек, рисованная анимация и шекспировский размах',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Мэттью Бродерик',
      'Джереми Айронс',
      'Нэйтан Лейн',
      'Эрни Сабелла',
      'Джеймс Эрл Джонс',
      'Мойра Келли',
      'Роуэн Эткинсон',
      'Вупи Голдберг',
      'Чич Марин',
      'Никета Калам',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '1994',
      },
      {
        property: 'Страна',
        value: 'США',
      },
      {
        property: 'Жанр',
        value: 'мультфильм, мюзикл, драма, приключения',
      },
      {
        property: 'Слоган',
        value: '«The Circle of Life»',
      },
      {
        property: 'Режиссер',
        value: 'Роджер Аллерс, Роб Минкофф',
      },
      {
        property: 'Сценарий',
        value: 'Ирен Меччи, Джонатан Робертс',
      },
      {
        property: 'Продюсер',
        value: 'Дон Хан, Элис Дьюи',
      },
      {
        property: 'Композитор',
        value: 'Ханс Циммер',
      },
      {
        property: 'Художник',
        value: 'Крис Сандерс, Энди Гэскилл',
      },
      {
        property: 'Монтаж',
        value: 'Иван Биланкио',
      },
      {
        property: 'Бюджет',
        value: '$45 000 000',
      },
      {
        property: 'Сборы в США',
        value: '$312 855 561',
      },
      {
        property: 'Сборы в мире',
        value: '+ $450 600 000 = $763 455 561',
      },
      {
        property: 'Премьера в Росcии',
        value: '22 марта 2012',
      },
      {
        property: 'Премьера в мире',
        value: '12 июня 1994',
      },
      {
        property: 'Возраст',
        value: '0+',
      },
      {
        property: 'Время',
        value: '88 мин. / 01:28',
      },
    ],
  },
  {
    id: '06',
    type: 'FILM',
    nameRu: 'Матрица',
    nameOriginal: 'The Matrix',
    posterUrl: '/static/images/covers/06.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/06.jpg',
    trailerDate: '4 октября 2019',
    trailerLength: '1:29',
    ratingKinopoisk: '8.5',
    ratingKinopoiskVoteCount: '629 161 оценка',
    ratingAgeLimits: '16+',
    description:
      'У величественного Короля-Льва Муфасы рождается наследник по имени Симба. Уже в детстве любознательный малыш становится жертвой интриг своего завистливого дяди Шрама, мечтающего о власти. Симба познаёт горе утраты, предательство и изгнание, но в конце концов обретает верных друзей и находит любимую. Закалённый испытаниями, он в нелёгкой борьбе отвоёвывает своё законное место в «Круге жизни», осознав, что значит быть настоящим Королём.',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Киану Ривз',
      'Лоренс Фишбёрн',
      'Кэрри-Энн Мосс',
      'Хьюго Уивинг',
      'Глория Фостер',
      'Джо Пантольяно',
      'Маркус Чонг',
      'Джулиан Араханга',
      'Мэтт Доран',
      'Белинда МакКлори',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '1999',
      },
      {
        property: 'Страна',
        value: 'США, Австралия',
      },
      {
        property: 'Жанр',
        value: 'фантастика, боевик',
      },
      {
        property: 'Слоган',
        value: '«Добро пожаловать в реальный мир»',
      },
      {
        property: 'Режиссер',
        value: 'Лана Вачовски, Лилли Вачовски',
      },
      {
        property: 'Сценарий',
        value: 'Лана Вачовски, Лилли Вачовски',
      },
      {
        property: 'Продюсер',
        value: 'Джоэл Силвер, Брюс Берман',
      },
      {
        property: 'Оператор',
        value: 'Билл Поуп',
      },
      {
        property: 'Композитор',
        value: 'Дон Дэвис',
      },
      {
        property: 'Художник',
        value: 'Оуэн Патерсон, Хью Бэйтап',
      },
      {
        property: 'Бюджет',
        value: '$63 000 000',
      },
      {
        property: 'Сборы в США',
        value: '$171 479 930',
      },
      {
        property: 'Сборы в мире',
        value: '+ $292 037 453 = $463 517 383',
      },
      {
        property: 'Премьера в Росcии',
        value: '14 октября 1999, «Каро-Премьер»',
      },
      {
        property: 'Премьера в мире',
        value: '24 марта 1999',
      },
      {
        property: 'Возраст',
        value: '16+',
      },
      {
        property: 'Время',
        value: '136 мин. / 02:16',
      },
    ],
  },
  {
    id: '07',
    type: 'FILM',
    nameRu: 'Шрэк',
    nameOriginal: 'Shrek',
    posterUrl: '/static/images/covers/07.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/07.jpg',
    trailerDate: '23 февраля 2008',
    trailerLength: '2:06',
    ratingKinopoisk: '8.1',
    ratingKinopoiskVoteCount: '502 584 оценки',
    ratingAgeLimits: '12+',
    description:
      'Жил да был в сказочном государстве большой зеленый великан по имени Шрэк. Жил он в гордом одиночестве в лесу, на болоте, которое считал своим. Но однажды злобный коротышка — лорд Фаркуад, правитель волшебного королевства, безжалостно согнал на Шрэково болото всех сказочных обитателей.',
    shortDescription:
      'Огр-мизантроп спасает принцессу, чтобы вернуть свое болото. Революционная анимация о том, что красота — внутри',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Майк Майерс',
      'Эдди Мёрфи',
      'Кэмерон Диаз',
      'Джон Литгоу',
      'Венсан Кассель',
      'Питер Деннис',
      'Клайв Пирс',
      'Джим Каммингс',
      'Бобби Блок',
      'Крис Миллер',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '2001',
      },
      {
        property: 'Страна',
        value: 'США, Япония',
      },
      {
        property: 'Жанр',
        value: 'мультфильм, фэнтези, комедия',
      },
      {
        property: 'Слоган',
        value: '«Its Big!»',
      },
      {
        property: 'Режиссер',
        value: 'Эндрю Адамсон, Вики Дженсон',
      },
      {
        property: 'Сценарий',
        value: 'Тед Эллиот, Терри Россио',
      },
      {
        property: 'Продюсер',
        value: 'Джеффри Катценберг, Арон Уорнер',
      },
      {
        property: 'Композитор',
        value: 'Гарри Грегсон-Уильямс, Джон Пауэлл',
      },
      {
        property: 'Художник',
        value: 'Джеймс Хегедус, Гийом Аретос',
      },
      {
        property: 'Бюджет',
        value: '$60 000 000',
      },
      {
        property: 'Сборы в США',
        value: '$267 665 011',
      },
      {
        property: 'Сборы в мире',
        value: '+ $216 744 207 = $484 409 218',
      },
      {
        property: 'Сборы в России',
        value: '$1 070 302',
      },
      {
        property: 'Премьера в Росcии',
        value: '31 октября 2001, «Ист-Вест»',
      },
      {
        property: 'Премьера в мире',
        value: '22 апреля 2001',
      },
      {
        property: 'Возраст',
        value: '12+',
      },
      {
        property: 'Время',
        value: '90 мин. / 01:30',
      },
    ],
  },
  {
    id: '08',
    type: 'FILM',
    nameRu: 'Темный рыцарь',
    nameOriginal: 'The Dark Knight',
    posterUrl: '/static/images/covers/08.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/08.jpg',
    trailerDate: '27 июля 2008',
    trailerLength: '2:24',
    ratingKinopoisk: '8.5',
    ratingKinopoiskVoteCount: '592 337 оценок',
    ratingAgeLimits: '16+',
    description:
      'Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта Джима Гордона и прокурора Харви Дента он намерен очистить улицы Готэма от преступности. Сотрудничество оказывается эффективным, но скоро они обнаружат себя посреди хаоса, развязанного восходящим криминальным гением, известным напуганным горожанам под именем Джокер.',
    shortDescription:
      'У Бэтмена появляется новый враг — философ-террорист Джокер. Кинокомикс, который вывел жанр на новый уровень',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Кристиан Бэйл',
      'Хит Леджер',
      'Аарон Экхарт',
      'Мэгги Джилленхол',
      'Гари Олдман',
      'Майкл Кейн',
      'Морган Фриман',
      'Чинь Хань',
      'Нестор Карбонелл',
      'Эрик Робертс',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '2008',
      },
      {
        property: 'Страна',
        value: 'США, Великобритания',
      },
      {
        property: 'Жанр',
        value: 'фантастика, боевик, триллер, криминал, драма',
      },
      {
        property: 'Слоган',
        value: '«Добро пожаловать в мир Хаоса!»',
      },
      {
        property: 'Режиссер',
        value: 'Кристофер Нолан',
      },
      {
        property: 'Сценарий',
        value: 'Кристофер Нолан, Джонатан Нолан',
      },
      {
        property: 'Продюсер',
        value: 'Кристофер Нолан, Чарльз Ровен',
      },
      {
        property: 'Оператор',
        value: 'Уолли Пфистер',
      },
      {
        property: 'Композитор',
        value: 'Джеймс Ньютон Ховард, Ханс Циммер',
      },
      {
        property: 'Художник',
        value: 'Нэйтан Краули, Марк Бартоломью',
      },
      {
        property: 'Бюджет',
        value: '$185 000 000',
      },
      {
        property: 'Сборы в США',
        value: '$533 345 358',
      },
      {
        property: 'Сборы в мире',
        value: '+ $469 700 000 = $1 003 045 358',
      },
      {
        property: 'Сборы в России',
        value: '$8 589 100',
      },
      {
        property: 'Премьера в Росcии',
        value: '14 августа 2008, «Каро-Премьер»',
      },
      {
        property: 'Премьера в мире',
        value: '14 июля 2008',
      },
      {
        property: 'Возраст',
        value: '16+',
      },
      {
        property: 'Время',
        value: '152 мин. / 02:32',
      },
    ],
  },
  {
    id: '09',
    type: 'FILM',
    nameRu: 'Дюна',
    nameOriginal: 'Dune: Part One',
    posterUrl: '/static/images/covers/09.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/09.jpg',
    trailerDate: '1 января 2022',
    trailerLength: '3:01',
    ratingKinopoisk: '7.7',
    ratingKinopoiskVoteCount: '529 418 оценок',
    ratingAgeLimits: '12+',
    description:
      'Наследник знаменитого дома Атрейдесов Пол отправляется вместе с семьей на одну из самых опасных планет во Вселенной — Арракис. Здесь нет ничего, кроме песка, палящего солнца, гигантских чудовищ и основной причины межгалактических конфликтов — невероятно ценного ресурса, который называется меланж. В результате захвата власти Пол вынужден бежать и скрываться, и это становится началом его эпического путешествия. Враждебный мир Арракиса приготовил для него множество тяжелых испытаний, но только тот, кто готов взглянуть в глаза своему страху, достоин стать избранным.',
    shortDescription:
      'Атрейдесы прибывают на планету, где им никто не рад. Фантастический эпос Дени Вильнёва с шестью «Оскарами»',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Тимоти Шаламе',
      'Ребекка Фергюсон',
      'Оскар Айзек',
      'Джош Бролин',
      'Джейсон Момоа',
      'Зендея',
      'Стеллан Скарсгард',
      'Хавьер Бардем',
      'Дэйв Батиста',
      'Шарлотта Рэмплинг',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '2021',
      },
      {
        property: 'Страна',
        value: 'США, Канада, Венгрия',
      },
      {
        property: 'Жанр',
        value: 'фантастика, боевик, драма, приключения',
      },
      {
        property: 'Слоган',
        value: '«Час настал»',
      },
      {
        property: 'Режиссер',
        value: 'Дени Вильнёв',
      },
      {
        property: 'Сценарий',
        value: 'Джон Спэйтс, Дени Вильнёв, Эрик Рот',
      },
      {
        property: 'Продюсер',
        value: 'Дени Вильнёв, Мэри Пэрент, Кейл Бойтер',
      },
      {
        property: 'Оператор',
        value: 'Грег Фрейзер',
      },
      {
        property: 'Композитор',
        value: 'Ханс Циммер',
      },
      {
        property: 'Художник',
        value: 'Патрис Верметт, Том Браун, Дэвид Доран',
      },
      {
        property: 'Бюджет',
        value: '$165 000 000',
      },
      {
        property: 'Сборы в США',
        value: '$108 327 830',
      },
      {
        property: 'Сборы в мире',
        value: '+ $292 343 959 = $400 671 789',
      },
      {
        property: 'Сборы в России',
        value: '$21 931 316',
      },
      {
        property: 'Премьера в Росcии',
        value: '16 сентября 2021, «UPI»',
      },
      {
        property: 'Премьера в мире',
        value: '3 сентября 2021',
      },
      {
        property: 'Возраст',
        value: '12+',
      },
      {
        property: 'Время',
        value: '155 мин. / 02:35',
      },
    ],
  },
  {
    id: '10',
    type: 'FILM',
    nameRu: 'Не смотрите наверх',
    nameOriginal: 'Dont Look Up',
    posterUrl: '/static/images/covers/10.jpg',
    trailerUrl: '#',
    trailerCoverUrl: '/static/images/trailerCovers/10.jpg',
    trailerDate: '8 сентября 2021',
    trailerLength: '1:16',
    ratingKinopoisk: '7.5',
    ratingKinopoiskVoteCount: '158 714 оценок',
    ratingAgeLimits: '18+',
    description:
      'Астрономы открывают новую комету и, рассчитав её траекторию, узнают, что через полгода она столкнётся с Землёй, что положит конец существованию человечества и всего живого на планете. Двое учёных с трудом добиваются аудиенции у президента США, но там к их предупреждению относятся с недоверием, тогда они выступают в популярной телепередаче, но большинство всё равно не воспринимает угрозу всерьёз.',
    videoPlayerUrl: '/static/videos/promo-trailer.mp4',
    actors: [
      'Леонардо ДиКаприо',
      'Дженнифер Лоуренс',
      'Мэрил Стрип',
      'Джона Хилл',
      'Кейт Бланшетт',
      'Роб Морган',
      'Марк Райлэнс',
      'Тайлер Перри',
      'Тимоти Шаламе',
      'Рон Перлман',
    ],
    tableAboutFilm: [
      {
        property: 'Год производства',
        value: '2021',
      },
      {
        property: 'Страна',
        value: 'США',
      },
      {
        property: 'Жанр',
        value: 'драма, фантастика, комедия',
      },
      {
        property: 'Слоган',
        value: '«Based on truly possible events»',
      },
      {
        property: 'Режиссер',
        value: 'Адам МакКей',
      },
      {
        property: 'Сценарий',
        value: 'Адам МакКей, Дэвид Сирота',
      },
      {
        property: 'Продюсер',
        value: 'Тони Грация, Cate Hardman,',
      },
      {
        property: 'Оператор',
        value: 'Линус Сандгрен',
      },
      {
        property: 'Композитор',
        value: 'Николас Брителл',
      },
      {
        property: 'Художник',
        value: 'Клэйтон Хартли, Джаред Патрик Гербиг',
      },
      {
        property: 'Бюджет',
        value: '$75 000 000',
      },
      {
        property: 'Сборы в мире',
        value: '$791 863',
      },
      {
        property: 'Премьера в мире',
        value: '5 декабря 2021',
      },
      {
        property: 'Возраст',
        value: '18+',
      },
      {
        property: 'Время',
        value: '138 мин. / 02:18',
      },
    ],
  },
]
